app/views/songs/_form.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  <%= artist_select(@artist, @song) %> <br>
  <%= select_tag @song.artist.name, options_from_collection_for_select(Artist.all, :id, :id) %> <br>
  <%= select_tag "song[artist_id]", options_from_collection_for_select(Artist.all, :id, :name) %> <br>